koson/JC8012P4A1C-HMI-CPP-Codebase/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration

# Custom LCD Configuration for JC1060P470C (Use GPIO23 for backlight)
# CONFIG_BSP_LCD_TYPE_1024_600 is not set

CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_IDF_MINIMAL_BUILD=n

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# RTS pin ไม่ได้ต่อกับ EN บน JC8012P4A1C — ไม่ให้ esptool reset หลัง flash (กด RESET บอร์ดเอง)
CONFIG_ESPTOOLPY_AFTER_NOACTION=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# PSRAM Configuration - 80MHz HEX mode (ESP-HOSTED SDIO compatible)
# NOTE: DO NOT USE 200MHz - ESP-HOSTED will force fallback to 20MHz!
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_80M=y

# Cache Configuration - Larger L2 cache for better performance
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compiler Optimization - SIZE (baseline). Switch to PERF after IRAM fix.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# FreeRTOS - Higher tick rate for smoother UI
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Enable required Montserrat fonts for UI
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_32=y

# LVGL Performance Configuration (from lvgl_demo_v9)
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# LVGL FPS Performance Monitor
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_PERF_MONITOR_ALIGN_BOTTOM_RIGHT=y

CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_MODE_3=y
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_MODE=3

CONFIG_EXAMPLE_LVGL_PORT_ROTATION_90=y
# CONFIG_EXAMPLE_LVGL_PORT_PPA_ROTATION_ENABLE is not set
# CONFIG_LVGL_PORT_ENABLE_PPA is not set
# REASON: PPA + buff_spiram=true causes esp_cache_msync(103) null ptr crash on every frame
# Root cause: esp_lvgl_port 2.7.2 PPA flush_cb passes invalid addr when buffer is in PSRAM
# Fix: disable PPA, use CPU for SW rotation. Revisit when esp_lvgl_port fixes PSRAM support.

# Enable experimental features for XIP
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ============================================================================
# ESP-HOSTED: SDIO transport (JC8012P4A1C with ESP32-C6)
# ============================================================================

# Enable ESP WiFi Remote with ESP-HOSTED backend (CRITICAL!)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLED=y

# Slave target: ESP32-C6 co-processor
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# P4 Function EV Board GPIO preset for SDIO
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y

# SDIO transport configuration
# CONFIG_ESP_HOSTED_SPI_HOST_INTERFACE is not set
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y  # disabled for HTTP server test
CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE=y

# Memory optimization: Reduce task stack sizes to prevent OOM at boot
CONFIG_ESP_HOSTED_RPC_TASK_STACK=4096
CONFIG_ESP_HOSTED_DFLT_TASK_STACK=3072
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=10
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=10

# SDIO pins for Slot 1 (hardcoded in BSP):
# CMD:GPIO19 CLK:GPIO18 D0:GPIO14 D1:GPIO15 D2:GPIO16 D3:GPIO17

# ============================================================================
# WiFi Remote Library (for ESP32-P4 + C6)
# ============================================================================
CONFIG_ESP_WIFI_REMOTE_LIBRARY=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# WiFi Remote Buffers
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER=y
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=1
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=1
CONFIG_WIFI_RMT_ESPNOW_MAX_ENCRYPT_NUM=7

# ============================================================================
# HTTP Server Configuration
# ============================================================================
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# ============================================================================
# Console Configuration - USB JTAG only (UART0/GPIO37/38 reserved for H7 SCPI)
# ============================================================================
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ============================================================================
# FAT Filesystem - Long Filename Support
# ============================================================================
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

